{
    "Title": "Competitive Fleet Rotation using Public Rental Listings",
    "Subtitle": "Scraping Competitor Webpages to Optimize Vehicle Distribution",
    "Business Impact": "By collecting publicly available fleet data from competitor websites, car rental agencies can proactively rotate vehicles to meet local demand, increasing overall utilization by about 15%.",
    "Sector": "Car Rental",
    "What data was collected": "Public web listings of available vehicles, competitor branch locations, rental categories, and posted rental rates, all sourced from competitor websites and aggregator portals.",
    "Why this matters": "Location-specific information often changes quickly. Real-time insights from competitor sites help identify oversupplied or undersupplied vehicle segments, enabling data-driven rotation decisions.",
    "Implementation time": "6 to 8 weeks, including scraper development for competitor sites, data normalization, and integration with existing fleet management dashboards.",
    "Problems this solves": "1) Guesswork in matching supply with demand. 2) Overlooked opportunities to fill short-term spikes in vehicle requests. 3) Reactive rather than proactive fleet transfers.",
    "Why it was better to outsource this solution": "A dedicated web scraping company has proven expertise in collecting accurate, real-time competitor data without violating site terms, ensuring consistent updates and robust coverage.",
    "Input Schema": "A JSON object with competitor URLs, the vehicle categories to track, and scraping frequency. Example: { 'competitor_sites': ['https://competitorA.com', 'https://competitorB.com'], 'vehicle_categories': ['SUV', 'Sedan'], 'scrape_interval': 'daily' }",
    "Output Schema": "A JSON object listing each location, available vehicle types, suggested rotations, and expected gains. Example: { 'location': 'LAX', 'available_competitor_vehicles': [...], 'rotation_recommendations': [...], 'utilization_boost': 0.15 }",
    "Matching algorithm used to integrate the data": "A location-based matching engine that compares competitor listings with internal data, prioritizing moves to branches reporting high demand and low inventory for specific categories.",
    "Story": "A mid-sized car rental firm noticed that while certain locations constantly ran low on premium SUVs, other sites had them idling. To tackle this, they tapped a web scraping company to gather public data on competitor vehicle availability posted on competitor websites. The scraper ran every few hours, collecting local inventory details and pricing for each vehicle category. With these fresh insights, the firm identified demand surges—especially around business districts for premium models—well before missing out on bookings. Thanks to a near-real-time view of competitor listings, the company began relocating SUVs to high-demand spots right before peak hours. This resulted in a tighter alignment of supply with local demand, raising utilization and reducing unnecessary cross-city shuttles. Had the firm tried to manually track these competitor changes, they would have faced stale or incomplete data. By outsourcing to experts, they gained fast, reliable, and compliant scraping that boosted fleet efficiency while respecting each competitor site’s public data. Ultimately, leveraging public online listings brought clarity to rotation decisions, improving both profitability and customer satisfaction."
  }
  