{
  "Title": "Achieving 100% Fee Disclosure Compliance by Automating OTA Price Audits",
  "Subtitle": "De-risking a Major Hotel Group's Operations by Proactively Monitoring Mandatory Fee Transparency Across All Online Travel Agencies",
  "Business Impact": "Reduced potential regulatory fines for non-compliance by over $2M annually and cut manual audit workload by 98%, saving an estimated 400+ person-hours per month.",
  "Sector": "Hotels",
  "What data was collected": "Comprehensive pricing data from the entire user booking funnel on major OTAs (Expedia, Booking.com, Agoda), including initial search result prices, hotel landing page prices, and final checkout-stage price breakdowns. Data points included base rate, taxes, mandatory resort fees, cleaning fees, and other service charges for specific properties in key regulatory jurisdictions.",
  "Why this matters": "Governments worldwide are enacting strict consumer protection laws against 'drip pricing' or 'junk fees.' Hotels must ensure all mandatory charges are displayed upfront across all third-party sales channels, or face severe financial penalties and reputational damage.",
  "Implementation time": "10 to 12 weeks for initial setup, which included configuring scrapers for five major OTAs across ten key legal jurisdictions, developing a compliance rules engine, and building a real-time alerting dashboard.",
  "Problems this solves": "1) High risk of multi-million dollar fines for violating fee transparency laws. 2) Inability to manually monitor hundreds of properties across dozens of ever-changing OTA websites. 3) Reputational damage and loss of customer trust from perceived hidden fees. 4) Lack of a centralized system to prove compliance to regulators.",
  "Why it was better to outsource this solution": "OTAs constantly change their website layouts and employ sophisticated anti-scraping measures. An expert partner like Iceberg Data maintains the complex infrastructure needed for resilient, large-scale data collection, and can quickly adapt to website changes, ensuring uninterrupted monitoring.",
  "Example_Input_JSON": {
    "client_id": "hotel-group-corp-451",
    "job_type": "fee_compliance_audit",
    "properties": [
      "prop-vegas-112",
      "prop-miami-305",
      "prop-orlando-901"
    ],
    "target_otas": [
      "booking.com",
      "expedia.com",
      "hotels.com"
    ],
    "jurisdictions": [
      "US-NV",
      "US-FL",
      "US-CA"
    ]
  },
  "Example_Output_JSON": {
    "report_id": "audit-NV-expedia-20250314",
    "property_id": "prop-vegas-112",
    "ota": "expedia.com",
    "jurisdiction": "US-NV",
    "audit_timestamp": "2025-03-14T22:15:00Z",
    "compliance_status": "NON_COMPLIANT",
    "discrepancy_details": [
      {
        "stage": "search_results_page",
        "issue_code": "FEE_NOT_INCLUDED_IN_TOTAL",
        "description": "Mandatory resort fee of $45.00 was not included in the primary price displayed on the search results page.",
        "displayed_price": "$299.00",
        "all_in_price_expected": "$344.00",
        "evidence_screenshot_url": "s3://bucket/evidence/screenshot-1a.png"
      }
    ]
  },
  "Matching algorithm used to integrate the data": "A multi-stage algorithm was used. First, fuzzy string matching and address verification were employed to accurately identify the client's properties across different OTAs, which often use slightly different naming conventions. Second, a DOM-path and visual-layout-based extraction model was trained to identify and parse pricing components (base rate, fees, taxes) at each stage of the booking funnel, making the system resilient to minor HTML structure changes.",
  "Story": "<p>Our client, a prestigious hotel management group with over 200 properties in North America, came to us with a rapidly escalating problem. The regulatory landscape around price transparency was shifting under their feet. States like California and Nevada, along with federal agencies, were launching a major crackdown on what they termed 'junk fees'—mandatory charges like resort fees or destination fees that were only revealed late in the booking process. The era of 'drip pricing' was ending, and the penalties for non-compliance were staggering.</p><p>Their internal compliance team was in a constant state of fire-fighting. They were attempting to manually check their property listings on major Online Travel Agencies (OTAs), but the scale of the task was impossible. With hundreds of properties, dozens of room types, and multiple OTAs, each with its own unique user interface, a full audit was out of the question. They were reduced to random spot-checks, which felt like trying to find a needle in a digital haystack. The breaking point came when they were hit with a significant six-figure fine for a violation in one state, a fee that was improperly disclosed on a single OTA for a short period. They realized their manual process was not a defense; it was a liability. They needed a systematic, automated, and evidence-based way to ensure compliance.</p><p><strong>This is where our team at Iceberg Data stepped in.</strong> We proposed a comprehensive Regulatory Compliance Monitoring solution. The goal was simple but technically complex: to simulate the entire customer journey for each of their properties on the most popular OTAs, capturing the price displayed at every single step, from the initial search result to the final confirmation page. This would provide irrefutable evidence of how their pricing, including all mandatory fees, was being presented to consumers.</p><p>Our first step was to collaborate with their legal team to codify the specific disclosure rules for each key jurisdiction. For example, one state might require the all-in price on the search page, while another might allow fees to be broken out as long as they are clearly visible before the user proceeds. We translated these legal requirements into a logical rules engine. Next, our data acquisition team built a fleet of sophisticated web scrapers tailored to each target OTA. These weren't simple scrapers; they had to navigate dynamic JavaScript-heavy websites, manage user sessions to proceed through the booking funnel, and handle advanced anti-bot measures.</p><p>Once the data started flowing, the impact was immediate. We fed the structured pricing data into our rules engine and presented the findings on a centralized dashboard. The client's compliance team could now see a clear, color-coded overview of their entire portfolio. <strong>Green meant fully compliant. Red meant an active violation.</strong> They could drill down into any red flag and see precisely where the non-compliance occurred. Our output, like the `Example_Output_JSON`, provided the property, the OTA, the specific page in the funnel (e.g., `search_results_page`), and a clear description of the issue, such as a 'Resort fee not included in initial displayed price'.</p><p>Within the first month, we identified over 800 instances of non-compliant fee disclosures across their portfolio. These were issues their manual checks had completely missed. Working with the OTAs and their internal revenue management teams, they were able to rectify these issues systematically. The result was a dramatic risk reduction. They successfully avoided what their legal counsel estimated could have been over $2 million in potential fines in the first year alone. More importantly, they transformed their compliance posture from reactive to proactive. The 400+ hours their team used to spend on tedious manual checks each month were reallocated to higher-value strategic tasks. Our ongoing monitoring now acts as their digital sentinel, ensuring that any changes made by an OTA or a local property manager that accidentally cause a compliance breach are flagged and fixed within hours, not months.</p>",
  "publicationDate": "2025-10-13"
}