{
  "Title": "Boosting Average Order Value by 18% Through Competitor Kit & Bundle Price Analysis",
  "Subtitle": "Using Web-Scraped Data to Deconstruct Competitor Product Bundles and Optimize Pricing for Higher Margins",
  "Business Impact": "Identified and replicated high-performing competitor bundles, leading to an 18% increase in Average Order Value (AOV) and a 5% improvement in profit margins within one quarter.",
  "Sector": "E-commerce",
  "What data was collected": "Product data from major competitor e-commerce sites, specifically focusing on product pages offering 'kits,' 'bundles,' or 'frequently bought together' sections. Data points included parent product SKU, bundled component SKUs, individual component prices, the final bundle price, and the stated discount percentage.",
  "Why this matters": "In competitive markets like consumer electronics, AOV is a key growth lever. Simply matching individual product prices leads to a race to the bottom. Understanding how competitors successfully bundle products allows a retailer to create more value for customers and increase transaction size without simply slashing prices.",
  "Implementation time": "6 to 8 weeks. This included initial scraper development for 5 key competitor sites, setting up a data pipeline to deconstruct bundle components, and building a dashboard to visualize bundling opportunities.",
  "Problems this solves": "1) Stagnant Average Order Value (AOV). 2) Inability to see which product combinations are most aggressively promoted by competitors. 3) Lost margin opportunities by offering suboptimal discounts on self-created bundles. 4) Manual, time-consuming, and error-prone process of checking competitor sites for bundle deals.",
  "Why it was better to outsource this solution": "Competitor websites use complex JavaScript to render bundle options and dynamic pricing. An expert web scraping partner can build and maintain robust scrapers that handle these complexities, parse the relationships between parent and child products in a bundle, and deliver clean, structured data ready for analysis.",
  "Example_Input_JSON": {
    "client_id": "CE-Retailer-789",
    "job_type": "competitor_bundle_analysis",
    "target_competitors": [
      "electrostore.com",
      "techgiant.net",
      "gadgetworld.co"
    ],
    "product_categories": [
      "Digital Cameras",
      "Drones",
      "Smart Home Devices"
    ],
    "data_points_required": [
      "bundle_title",
      "bundle_sku",
      "final_price",
      "total_individual_price",
      "discount_amount",
      "component_products"
    ]
  },
  "Example_Output_JSON": {
    "report_id": "bundle-report-a1b2-c3d4",
    "source_url": "https://electrostore.com/products/pro-cam-x5-creators-kit",
    "scraped_at": "2024-11-05T14:30:00Z",
    "bundle_title": "Pro-Cam X5 Creator's Kit",
    "bundle_sku": "PCX5-CK-01",
    "pricing": {
      "final_bundle_price": 1499.99,
      "total_individual_price": 1649.95,
      "discount_amount": 149.96,
      "discount_percentage": 9.09
    },
    "component_products": [
      {
        "name": "Pro-Cam X5 Body",
        "sku": "PCX5-BODY",
        "individual_price": 1199.99
      },
      {
        "name": "50mm Prime Lens",
        "sku": "LENS-50MM-F18",
        "individual_price": 199.99
      },
      {
        "name": "High-Speed 128GB SD Card",
        "sku": "SD-128GB-V90",
        "individual_price": 89.99
      },
      {
        "name": "Extra Battery Pack",
        "sku": "BATT-PRO-X5",
        "individual_price": 59.98
      }
    ]
  },
  "Matching algorithm used to integrate the data": "A combination of SKU matching and Natural Language Processing (NLP) was used. Initially, scrapers extracted component SKUs from the bundle pages. When SKUs weren't available, an NLP model trained on product titles and descriptions identified the individual products within the bundle description text. This data was then joined with our client's own product catalog using a fuzzy matching algorithm on product titles and specifications to identify comparable products and calculate margin implications.",
  "Story": "<p>Our client, a thriving e-commerce retailer in the consumer electronics space, came to us with a frustrating problem. They were experts at pricing their core products—cameras, drones, and audio equipment—competitively. They used sophisticated tools to monitor and match individual product prices against their key rivals. Yet, their profit margins were shrinking, and their Average Order Value (AOV) had been stubbornly flat for three consecutive quarters. They were winning the battle on individual prices but losing the war for customer lifetime value.</p><p>The client suspected the issue lay in <strong>product bundling</strong>. They saw competitors offering 'Creator Kits,' 'Starter Packs,' and other bundled deals, but they had no systematic way to track or analyze them. Their merchandising team would manually check a few competitor sites each week, a process that was not only time-consuming but also woefully incomplete. They couldn't answer crucial strategic questions: Which products are most frequently bundled together? What is the true discount competitors are offering? Are certain bundles loss-leaders designed to acquire new customers, or are they high-margin upsells? They were flying blind.</p><p>This is where our team at Iceberg Data came in. We proposed a comprehensive competitive intelligence solution focused entirely on deconstructing these bundles. The technical challenge was significant. Most e-commerce sites don't list bundles as simple products; they are often dynamically rendered on the page using JavaScript, with options and components that change based on user selection. A simple scraper wouldn't work.</p><p><strong>Our approach was to build intelligent scrapers that could mimic human behavior,</strong> navigating these complex product pages to identify every component within a bundle. For each kit, we were programmed to extract the final bundle price, the titles and SKUs of every individual item included, and—most critically—the price of each of those items if sold separately on the same website. This allowed us to calculate the real, underlying discount strategy, not just the flashy 'Save $100!' banner on the page.</p><p>Within weeks, the data began painting a clear picture. We delivered a continuous feed of structured JSON data directly to their analytics platform, detailing the bundling strategies of their top five competitors across hundreds of products. The 'aha!' moment came when we analyzed the data for a top-selling mirrorless camera. Our client was selling the camera body for $5 less than their main competitor, assuming they were winning. However, our data showed that this competitor sold the camera body in a 'Video Creator Kit' that included a high-margin microphone, a premium memory card, and an extra battery. This bundle was their most promoted option and accounted for an estimated 60% of their sales for that camera model. The competitor was losing a few dollars on the camera to win a much larger, more profitable overall sale.</p><p>Armed with this granular intelligence, the client's strategy shifted overnight. Their merchandising team used our data to design their own tiered 'good-better-best' bundle strategy for their top 50 products. They created a basic 'Starter Kit' to compete on price, but also a 'Pro Kit' that included high-margin, private-label accessories like tripods and camera bags. The results were immediate and dramatic. <strong>In the first quarter after implementing their new data-driven bundling strategy, their AOV surged by 18%.</strong> Because they were strategically including their own high-margin products in the bundles, their overall profit margin increased by a healthy 5%, completely reversing the previous downward trend. Today, our data feed is a core component of their weekly pricing and merchandising meetings, allowing them to be agile and proactive in one of the most competitive markets in e-commerce.</p>",
  "publicationDate": "2025-12-03"
}