{
    "Title": "High-Level B2B Lead Extraction from Public Speaker Agendas",
    "Subtitle": "Scraping Conference Schedules to Connect with Industry Thought Leaders",
    "Business Impact": "Reaching out to speakers who publicly appear at industry summits can bolster top-of-funnel leads, especially if those individuals hold key decision-making roles.",
    "Sector": "Lead Generation",
    "What data was collected": "Public speaker rosters, session abstracts, social media announcements from event organizers, and visible LinkedIn profiles referencing scheduled speaking engagements.",
    "Why this matters": "Conference speakers typically shape or lead strategies within their companies. Capturing public info on where and when they speak can open doors to significant partnerships or sales opportunities.",
    "Implementation time": "4 to 6 weeks, focusing on event website scraping, speaker detail extraction, and cross-referencing LinkedIn for role verification.",
    "Problems this solves": "1) Time-consuming manual checks of event pages. 2) Overlooking influential individuals who only speak at niche or virtual events. 3) Missed relationship-building opportunities if outreach happens too late.",
    "Why it was better to outsource this solution": "Professional event scrapers keep track of changing agendas, last-minute speaker additions, and do so in a policy-compliant manner to compile fresh leads for each conference.",
    "Input Schema": "A JSON object with conference URLs, target speaker roles, and desired sectors. Example: { 'summit_pages': ['https://cybersummit.com/agenda'], 'target_roles': ['CISO', 'CTO'], 'industry': 'Cybersecurity' }",
    "Output Schema": "A JSON array listing speaker names, job titles, companies, and public links. Example: [ { 'name': 'Dr. Alice Carter', 'title': 'CISO', 'company': 'SecureNow', 'linkedin': '...', 'session_time': '2025-04-10 10:00AM' }, ... ]",
    "Matching algorithm used to integrate the data": "Agenda items are parsed for speaker details; any LinkedIn or social handle is validated for accurate job titles. Additional metadata helps rank speaker influence (e.g., session keynotes).",
    "Story": "An enterprise security solutions provider aimed to connect with senior cybersecurity professionals. They recognized that many such leaders frequently speak at industry events, but manually scanning conference websites was tedious. The provider partnered with a web scraping firm specialized in event-based data extraction. The scrapers crawled official summit pages, extracting session titles and speaker lineups. They also monitored social media announcements from organizers who tagged scheduled participants. Whenever the system found a CISO or CTO role, it cross-referenced public LinkedIn data to confirm their corporate affiliation. Within just a few weeks, the solutions provider compiled a robust database of upcoming conference speakers—potential high-value leads. Their outreach team then sent personalized invitations to speak about mutual security challenges or requested product demos. Because all data was publicly available, the approach remained compliant, and the quick follow-up impressed many keynote-level speakers. Some of these interactions blossomed into strategic partnerships, proof-of-concept engagements, or even co-authored white papers. By outsourcing the scraping process, the provider seamlessly tracked new additions to event agendas, ensuring they never missed an opportunity to connect with top industry minds."
  }
  