{
  "Title": "Customer Segmentation via Public Rental Activity",
  "Subtitle": "Scraping Shared Bookings and Trip Data to Identify High-Value Corporate Clients",
  "Business Impact": "Spotting recurring corporate travel patterns from public aggregator sites can drive targeted B2B deals, potentially boosting corporate revenue by 25%.",
  "Sector": "Car Rental",
  "What data was collected": "Aggregated location-based rental activity, corporate discount codes publicly advertised, frequent-traveler feedback from business travel forums, and competitor corporate deals listed online.",
  "Why this matters": "B2B travelers often yield higher margins than casual renters. Seeing how corporate demand fluctuates across different platforms uncovers which companies may need premium fleet contracts.",
  "Implementation time": "6 to 8 weeks, involving aggregator site scraping, analysis of business travel forums, and correlation with competitor corporate package listings.",
  "Problems this solves": "1) Lack of data on which firms rent cars frequently. 2) Fragmented insights into competitor corporate programs. 3) Missed opportunities for premium upsells or VIP partnerships.",
  "Why it was better to outsource this solution": "External web scraping specialists know how to navigate aggregator sites and forum platforms without violating usage rules, ensuring a steady flow of legitimate, publicly available data.",
  "Input Schema": "A JSON object indicating aggregator platforms, desired discount code patterns, and business travel forums to monitor. Example: { 'aggregator_urls': ['...'], 'corporate_discount_keywords': ['corp code', 'business rate'], 'forums': ['LinkedIn Groups', 'FlyerTalk'] }",
  "Output Schema": "A JSON object categorizing corporate accounts by potential volume, listing competitor discounts found, and recommended outreach strategies. Example: { 'corporate_leads': [...], 'identified_discounts': [...], 'targeting_recommendations': [{...}] }",
  "Matching algorithm used to integrate the data": "A pattern-matching engine identifies repeated usage of specific corporate codes, location-based frequency, and competitor offers. Data is sorted by total booking estimates.",
  "Story": "A car rental agency aimed to grow its corporate client base but had limited visibility into which businesses consistently booked rentals through aggregator sites. By partnering with a web scraping firm, they extracted data on publicly posted corporate discount codes, cross-checked aggregator usage stats, and monitored business travel forums where professionals often shared tips on discount rates. This combined dataset let the agency see which companies or industries were actively renting multiple cars at once, and how competitor deals stacked up in those segments. For example, a logistics firm appeared to be using a ‘BusinessPro’ code that shaved off 20% of each booking on a rival platform—a strong indicator of high rental volume. The data also highlighted certain tech startups frequently referencing short-term corporate codes in online travel discussions. Equipped with this intelligence, the rental agency tailored a specialized B2B offer, bundling premium fleet options with expedited pickup. Outsourcing the scraping was critical because it ensured compliance with aggregator rules and forum guidelines. The corporate leads thus generated helped the rental agency secure new corporate accounts and nurture them with premium service, boosting loyalty and revenue in a previously under-tapped space.",
  "publicationDate": "2023-09-29"
}